引用:
- [十分钟的 pandas 入门教程（中文翻译）](https://ericfu.me/10-minutes-to-pandas/)
- [Minutes to panda](http://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html)

十分钟你妹啊！！

导入 pandas、numpy

In [2]:
import numpy as np
import pandas as pd

# 创建对象

See the [Data Structure Intro section](http://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html#dsintro).

Series 是一个值的序列，它只有一个列，以及索引。下面的例子中，就用默认的整数索引

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

DataFrame 是有多个列的数据表，每个列拥有一个 label，当然，DataFrame 也有索引
下面例子创建一个DataFrame做了三件事

- 1. 传递一个Numpy数组
- 2. datetime结构的索引
- 3. 标记的列名

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.017521 -0.332180  1.853254 -0.202554
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443
2013-01-03 -0.672110  1.005164  0.953992 -1.051280
2013-01-04  0.683691 -2.141668 -0.671858 -2.540891
2013-01-05  0.470989  1.037258  0.560240  2.249227
2013-01-06 -0.948169  0.579083  1.020675 -1.437743

如果参数是一个 dict，每个 dict 的 value 会被转化成一个 Series

In [7]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20130102'),
                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                     'D': np.array([3] * 4, dtype='int32'),
                     'E': pd.Categorical(["test", "train", "test", "train"]),
                     'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

每列的格式用 dtypes 查看

In [8]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

你可以认为，DataFrame 是由 Series 组成的

In [9]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

# 查看数据
用 head 和 tail 查看顶端和底端的几列

In [10]:
df.head()

                   A         B         C         D
2013-01-01 -1.017521 -0.332180  1.853254 -0.202554
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443
2013-01-03 -0.672110  1.005164  0.953992 -1.051280
2013-01-04  0.683691 -2.141668 -0.671858 -2.540891
2013-01-05  0.470989  1.037258  0.560240  2.249227

In [12]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.860834 -0.334536 -0.852398  1.120468
2013-01-05 -0.606492 -0.424753 -1.045444 -0.477015
2013-01-06 -0.311446  0.698276  0.905798 -0.125221

实际上，DataFrame 内部用 numpy 格式存储数据。你也可以单独查看 index 和 columns

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [16]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[-1.01752071e+00, -3.32179891e-01,  1.85325382e+00,
        -2.02554114e-01],
       [-3.49845108e-01, -1.30933774e+00, -1.30306934e-01,
        -2.44343870e-03],
       [-6.72109923e-01,  1.00516430e+00,  9.53991876e-01,
        -1.05127980e+00],
       [ 6.83690516e-01, -2.14166802e+00, -6.71858447e-01,
        -2.54089124e+00],
       [ 4.70989402e-01,  1.03725840e+00,  5.60240243e-01,
         2.24922713e+00],
       [-9.48169360e-01,  5.79083160e-01,  1.02067508e+00,
        -1.43774323e+00]])

DataFrame.to_numpy()返回内部数据的Numpy格式描述，请注意，当您的DataFrame具有不同数据类型的列时，他可能是一项昂贵的操作，这归结为pandas和NumPy之间的根本区别：NumPy数组对整个数组有一个dtype，而pandas DataFrames每列有一个dtype。

In [13]:
df.to_numpy()

array([[-1.01752071e+00, -3.32179891e-01,  1.85325382e+00,
        -2.02554114e-01],
       [-3.49845108e-01, -1.30933774e+00, -1.30306934e-01,
        -2.44343870e-03],
       [-6.72109923e-01,  1.00516430e+00,  9.53991876e-01,
        -1.05127980e+00],
       [ 6.83690516e-01, -2.14166802e+00, -6.71858447e-01,
        -2.54089124e+00],
       [ 4.70989402e-01,  1.03725840e+00,  5.60240243e-01,
         2.24922713e+00],
       [-9.48169360e-01,  5.79083160e-01,  1.02067508e+00,
        -1.43774323e+00]])

In [16]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

describe() 显示数据的概要。

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.305494 -0.193613  0.597666 -0.497614
std    0.726333  1.312108  0.897267  1.627437
min   -1.017521 -2.141668 -0.671858 -2.540891
25%   -0.879155 -1.065048  0.042330 -1.341127
50%   -0.510978  0.123452  0.757116 -0.626917
75%    0.265781  0.898644  1.004004 -0.052471
max    0.683691  1.037258  1.853254  2.249227

和 numpy 一样，可以方便的得到转置

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.017521   -0.349845   -0.672110    0.683691    0.470989   -0.948169
B   -0.332180   -1.309338    1.005164   -2.141668    1.037258    0.579083
C    1.853254   -0.130307    0.953992   -0.671858    0.560240    1.020675
D   -0.202554   -0.002443   -1.051280   -2.540891    2.249227   -1.437743

对 axis 按照 index 排序（axis=1 是指第二个维度，即：列）

In [18]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.202554  1.853254 -0.332180 -1.017521
2013-01-02 -0.002443 -0.130307 -1.309338 -0.349845
2013-01-03 -1.051280  0.953992  1.005164 -0.672110
2013-01-04 -2.540891 -0.671858 -2.141668  0.683691
2013-01-05  2.249227  0.560240  1.037258  0.470989
2013-01-06 -1.437743  1.020675  0.579083 -0.948169

按值排序

In [19]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.683691 -2.141668 -0.671858 -2.540891
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443
2013-01-01 -1.017521 -0.332180  1.853254 -0.202554
2013-01-06 -0.948169  0.579083  1.020675 -1.437743
2013-01-03 -0.672110  1.005164  0.953992 -1.051280
2013-01-05  0.470989  1.037258  0.560240  2.249227

# 选择
注意，以下这些对交互式环境很友好，但是作为 production code 请用优化过的 .at, .iat, .loc, .iloc 和 .ix
## 获取行/列
从 DataFrame 选择一个列，就得到了 Series，等同于df.A

In [21]:
df['A']

2013-01-01   -1.017521
2013-01-02   -0.349845
2013-01-03   -0.672110
2013-01-04    0.683691
2013-01-05    0.470989
2013-01-06   -0.948169
Freq: D, Name: A, dtype: float64

和 numpy 类似，这里也能用 [],表示选择某些行

In [22]:
df[0:2]

                   A         B         C         D
2013-01-01 -1.017521 -0.332180  1.853254 -0.202554
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443

In [23]:
df['20130102':'20130103']

                   A         B         C         D
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443
2013-01-03 -0.672110  1.005164  0.953992 -1.051280

## 通过 label 选择
刚刚那个 DataFrame 可以通过时间戳的下标（dates[0] = Timestamp('20130101')）来访问

In [24]:
df.loc[dates[0]]

A   -1.017521
B   -0.332180
C    1.853254
D   -0.202554
Name: 2013-01-01 00:00:00, dtype: float64

还可以多选

In [25]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -1.017521 -0.332180
2013-01-02 -0.349845 -1.309338
2013-01-03 -0.672110  1.005164
2013-01-04  0.683691 -2.141668
2013-01-05  0.470989  1.037258
2013-01-06 -0.948169  0.579083

注意那个冒号，用法和 MATLAB 或 NumPy 是一样的！所以也可以这样

In [29]:
df.loc['20130102':'20130103',['A','B']]

                   A         B
2013-01-02 -0.349845 -1.309338
2013-01-03 -0.672110  1.005164

依旧和 MATLAB 一样，当有一个维度是标量（而不是范围或序列）的时候，选择出的矩阵维度会减少

In [30]:
df.loc['20130102',['A','B']]

A   -0.349845
B   -1.309338
Name: 2013-01-02 00:00:00, dtype: float64

如果对所有的维度都写了标量，不就是选出一个元素吗？

In [32]:
df.loc['20130102','A']

-0.3498451080283063

这种情况通常用 at ，速度更快

In [34]:
df.at[dates[0],'A']

-1.0175207064386236

## 通过整数下标选择
**和 MATLAB 完全一样**
这个就和数组类似啦，直接看例子

In [35]:
df.iloc[3]

A    0.683691
B   -2.141668
C   -0.671858
D   -2.540891
Name: 2013-01-04 00:00:00, dtype: float64

In [36]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04  0.683691 -2.141668
2013-01-05  0.470989  1.037258

也能用 list 选择

In [37]:
 df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -0.349845 -0.130307
2013-01-03 -0.672110  0.953992
2013-01-05  0.470989  0.560240

也能用slice，如上面的df.iloc[3:5,0:2]

对应单个元素

In [39]:
df.iloc[1,1]

-1.3093377399208113

In [40]:
df.iat[1,1]

-1.3093377399208113

## 布尔值下标
**MATLAB 类似**
基本用法，使用单独一列的值选择数据

In [42]:
df[df.A > 0] #取满足条件的行

                   A         B         C         D
2013-01-04  0.683691 -2.141668 -0.671858 -2.540891
2013-01-05  0.470989  1.037258  0.560240  2.249227

In [43]:
df[df > 0] # 没有填充的值等于 NaN

                   A         B         C         D
2013-01-01       NaN       NaN  1.853254       NaN
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN  1.005164  0.953992       NaN
2013-01-04  0.683691       NaN       NaN       NaN
2013-01-05  0.470989  1.037258  0.560240  2.249227
2013-01-06       NaN  0.579083  1.020675       NaN

使用isin()进行过滤

In [44]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -1.017521 -0.332180  1.853254 -0.202554    one
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443    one
2013-01-03 -0.672110  1.005164  0.953992 -1.051280    two
2013-01-04  0.683691 -2.141668 -0.671858 -2.540891  three
2013-01-05  0.470989  1.037258  0.560240  2.249227   four
2013-01-06 -0.948169  0.579083  1.020675 -1.437743  three

In [45]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.672110  1.005164  0.953992 -1.051280   two
2013-01-05  0.470989  1.037258  0.560240  2.249227  four

# Setting
为 DataFrame 增加新的列，自动通过 index对齐数据

In [46]:
s1 = pd.Series(range(4), index=pd.date_range('20130102', periods=4))
s1

2013-01-02    0
2013-01-03    1
2013-01-04    2
2013-01-05    3
Freq: D, dtype: int64

In [47]:
df['F']=s1
df

                   A         B         C         D    F
2013-01-01 -1.017521 -0.332180  1.853254 -0.202554  NaN
2013-01-02 -0.349845 -1.309338 -0.130307 -0.002443  0.0
2013-01-03 -0.672110  1.005164  0.953992 -1.051280  1.0
2013-01-04  0.683691 -2.141668 -0.671858 -2.540891  2.0
2013-01-05  0.470989  1.037258  0.560240  2.249227  3.0
2013-01-06 -0.948169  0.579083  1.020675 -1.437743  NaN

通过label设置值

In [52]:
df.at[dates[0], 'A'] = 0 #df.at[dates[0],'A'] = 0
df.iat[0,1] = 0 #通过下标设置
df.loc[:,'D'] = np.array([5] * len(df)) #用 numpy 数组设置
df[df > 0] = -df #用布尔值作下标的 set

In [53]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.853254 -5  NaN
2013-01-02 -0.349845 -1.309338 -0.130307 -5  0.0
2013-01-03 -0.672110 -1.005164 -0.953992 -5 -1.0
2013-01-04 -0.683691 -2.141668 -0.671858 -5 -2.0
2013-01-05 -0.470989 -1.037258 -0.560240 -5 -3.0
2013-01-06 -0.948169 -0.579083 -1.020675 -5  NaN

注意，对于df[df > 0] = -df的方式，如果某一列为str，比如df2[df2 > 0] = -df2 
会抛出异常，可以下面方式先部分赋值的方式

In [68]:
# df2[df2 > 0] = -df2 
df3= df2.iloc[:,0:4]
df3[df3 < 0] = -df3
df3

                   A         B         C         D
2013-01-01  1.017521  0.332180  1.853254  0.202554
2013-01-02  0.349845  1.309338  0.130307  0.002443
2013-01-03  0.672110  1.005164  0.953992  1.051280
2013-01-04  0.683691  2.141668  0.671858  2.540891
2013-01-05  0.470989  1.037258  0.560240  2.249227
2013-01-06  0.948169  0.579083  1.020675  1.437743

In [69]:
df2.iloc[:,0:4] = df3
df2

                   A         B         C         D      E
2013-01-01  1.017521  0.332180  1.853254  0.202554    one
2013-01-02  0.349845  1.309338  0.130307  0.002443    one
2013-01-03  0.672110  1.005164  0.953992  1.051280    two
2013-01-04  0.683691  2.141668  0.671858  2.540891  three
2013-01-05  0.470989  1.037258  0.560240  2.249227   four
2013-01-06  0.948169  0.579083  1.020675  1.437743  three

## 缺失值
pandas 用 np.nan 表示缺失值。通常它不会被计算。

Reindexing 允许你改变某个轴的 index（以下代码返回一个数据拷贝）

In [73]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns))
df1

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.853254  5  NaN
2013-01-02  0.349845  1.309338  0.130307  5  0.0
2013-01-03  0.672110  1.005164  0.953992  5  NaN
2013-01-04  0.683691  2.141668  0.671858  5  NaN

In [76]:
df1.dropna(how='any') #丢弃有 NaN 的

                   A         B         C  D    F
2013-01-02  0.349845  1.309338  0.130307  5  0.0

In [75]:
df1.fillna(value=5) #填充缺失值

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.853254  5  5.0
2013-01-02  0.349845  1.309338  0.130307  5  0.0
2013-01-03  0.672110  1.005164  0.953992  5  5.0
2013-01-04  0.683691  2.141668  0.671858  5  5.0

In [77]:
pd.isnull(df1) #获取布尔值的 mask：哪些值是 NaN

                A      B      C      D      F
2013-01-01  False  False  False  False   True
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True

# 操作
## 统计
**通常，操作都会把 NaN 排除在外**

平均值

In [81]:
df.mean() #平均值 等同于 df.mean(0)

A    0.520801
B    1.012085
C    0.865054
D    5.000000
F    0.000000
dtype: float64

In [83]:
df.mean(1) #对另一个维度做平均值，只要加个参数

2013-01-01    1.713313
2013-01-02    1.357898
2013-01-03    1.907817
2013-01-04    2.124304
2013-01-05    1.767122
2013-01-06    1.886982
Freq: D, dtype: float64

In [ ]:
## Apply
对数据（行或列） Apply 函数

In [85]:
df.apply(np.cumsum)  # np.cumsum(a,  axis=None, dtype=None, out=None),按照所给定的轴参数返回元素的梯形累计和，axis=0，按照行累加。axis=1，按照列累加

                   A         B         C   D    F
2013-01-01  0.000000  0.000000  1.853254   5  NaN
2013-01-02  0.349845  1.309338  1.983561  10  0.0
2013-01-03  1.021955  2.314502  2.937553  15  NaN
2013-01-04  1.705646  4.456170  3.609411  20  NaN
2013-01-05  2.176635  5.493428  4.169651  25  NaN
2013-01-06  3.124804  6.072512  5.190326  30  NaN

In [86]:
df.apply(lambda x: x.max() - x.min()) 
# 默认把axis=0，把每一列作为Series数据

A    0.948169
B    2.141668
C    1.722947
D    0.000000
F    0.000000
dtype: float64

In [87]:
df.apply(lambda x: x.max() - x.min(),axis=1)

2013-01-01    5.000000
2013-01-02    5.000000
2013-01-03    4.327890
2013-01-04    4.328142
2013-01-05    4.529011
2013-01-06    4.420917
Freq: D, dtype: float64

## 直方图

In [88]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    3
2    1
3    5
4    4
5    3
6    0
7    2
8    0
9    0
dtype: int64

In [89]:
s.value_counts()

0    3
3    2
6    1
5    1
4    1
2    1
1    1
dtype: int64

## 字符串函数
Series 自带了很多字符串处理函数，在 str 属性中，下面是一个例子

In [90]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [91]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge
## 拼接
简单地按行拼接

In [93]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  1.069830 -0.693364 -1.845770  1.809566
1  2.487307 -0.880092 -1.404297  0.806023
2 -1.016338 -0.193645 -0.765684  0.642111
3  0.312875  0.549254  2.075318  0.649807
4 -1.331730  1.823946 -1.034486  1.224563
5  0.689435  1.359479 -1.321735  0.998836
6 -1.050643  1.357293 -0.505223  0.181896
7 -0.269227 -1.113744  0.566773 -0.755414
8 -0.926833 -0.250313 -1.353632 -0.475822
9 -1.105050 -1.721665 -0.108716 -0.411912

In [94]:
pieces = [df[3:7], df[:3], df[7:]]  #break it into pieces
pieces

[          0         1         2         3
 3  0.312875  0.549254  2.075318  0.649807
 4 -1.331730  1.823946 -1.034486  1.224563
 5  0.689435  1.359479 -1.321735  0.998836
 6 -1.050643  1.357293 -0.505223  0.181896,
           0         1         2         3
 0  1.069830 -0.693364 -1.845770  1.809566
 1  2.487307 -0.880092 -1.404297  0.806023
 2 -1.016338 -0.193645 -0.765684  0.642111,
           0         1         2         3
 7 -0.269227 -1.113744  0.566773 -0.755414
 8 -0.926833 -0.250313 -1.353632 -0.475822
 9 -1.105050 -1.721665 -0.108716 -0.411912]

In [95]:
pd.concat(pieces)

          0         1         2         3
3  0.312875  0.549254  2.075318  0.649807
4 -1.331730  1.823946 -1.034486  1.224563
5  0.689435  1.359479 -1.321735  0.998836
6 -1.050643  1.357293 -0.505223  0.181896
0  1.069830 -0.693364 -1.845770  1.809566
1  2.487307 -0.880092 -1.404297  0.806023
2 -1.016338 -0.193645 -0.765684  0.642111
7 -0.269227 -1.113744  0.566773 -0.755414
8 -0.926833 -0.250313 -1.353632 -0.475822
9 -1.105050 -1.721665 -0.108716 -0.411912

## Join
和 SQL 的 join 是一个意思

In [108]:
left = pd.DataFrame({'key': ['foo1', 'foo2'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo2', 'foo3'], 'rval': [4, 5]})

In [109]:
left

    key  lval
0  foo1     1
1  foo2     2

In [110]:
right

    key  rval
0  foo2     4
1  foo3     5

In [111]:
pd.merge(left, right, on='key')

    key  lval  rval
0  foo2     2     4

In [112]:
pd.merge(left, right, on='key',how='outer')

    key  lval  rval
0  foo1   1.0   NaN
1  foo2   2.0   4.0
2  foo3   NaN   5.0

In [113]:
pd.merge(left, right, on='key',how='left')

    key  lval  rval
0  foo1     1   NaN
1  foo2     2   4.0

In [114]:
pd.merge(left, right, on='key',how='right')

    key  lval  rval
0  foo2   2.0     4
1  foo3   NaN     5

## Append
向 DataFrame 增加新的数据行

In [115]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  1.596811  0.958120 -0.433443 -0.742534
1 -1.073859  0.659011 -1.040445  0.557003
2 -1.379623 -1.047177 -0.960648 -0.085574
3 -0.035053  0.522218  0.348698  1.344293
4  0.679004  0.454008  1.891098  0.736362
5  0.493305 -0.152323  1.630581  1.023400
6  0.317354 -0.143112  0.351949 -0.072667
7  0.055119 -0.509543  0.547073 -1.245465

In [117]:
s = df.iloc[3]
s

A   -0.035053
B    0.522218
C    0.348698
D    1.344293
Name: 3, dtype: float64

In [118]:
df.append(s, ignore_index=True)

          A         B         C         D
0  1.596811  0.958120 -0.433443 -0.742534
1 -1.073859  0.659011 -1.040445  0.557003
2 -1.379623 -1.047177 -0.960648 -0.085574
3 -0.035053  0.522218  0.348698  1.344293
4  0.679004  0.454008  1.891098  0.736362
5  0.493305 -0.152323  1.630581  1.023400
6  0.317354 -0.143112  0.351949 -0.072667
7  0.055119 -0.509543  0.547073 -1.245465
8 -0.035053  0.522218  0.348698  1.344293

## Grouping
和 SQL 中的 GROUP BY 类似，包括以下这几步：

- 根据某些规则，把数据分组
- 对每组应用一个聚集函数，把结果放在一个数据结构中

准备一下测试用的数据集

In [119]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                   'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                   'C' : np.random.randn(8),
                   'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.161781  1.565004
1  bar    one  0.677520  0.940169
2  foo    two  0.627892  0.803879
3  bar  three  1.266701 -2.412477
4  foo    two -1.212644  0.300552
5  bar    two -1.006921  0.395532
6  foo    one -0.922836 -0.221177
7  foo  three -0.372307  0.524430

In [120]:
df.groupby('A').sum() # 做 Group 操作并对每组求和

            C         D
A
bar  0.937300 -1.076776
foo -1.718113  2.972687

In [121]:
df.groupby(['A','B']).sum() # 可以对两列进行 Group by 并求和

                  C         D
A   B
bar one    0.677520  0.940169
    three  1.266701 -2.412477
    two   -1.006921  0.395532
foo one   -0.761055  1.343827
    three -0.372307  0.524430
    two   -0.584751  1.104430

ValueError: could not convert string to float: 'x'